Yurik72/ESPHap/examples/ESPHAPCamera/ESP32WiFiManager.cpp

#include "ESP32WifiManager.h"


AsyncWiFiManagerParameter::AsyncWiFiManagerParameter(const char *custom) {
  _id = NULL;
  _placeholder = NULL;
  _length = 0;
  _value = NULL;

  _customHTML = custom;
}

AsyncWiFiManagerParameter::AsyncWiFiManagerParameter(const char *id, const char *placeholder, const char *defaultValue, int length) {
  init(id, placeholder, defaultValue, length, "");
}

AsyncWiFiManagerParameter::AsyncWiFiManagerParameter(const char *id, const char *placeholder, const char *defaultValue, int length, const char *custom) {
  init(id, placeholder, defaultValue, length, custom);
}

void AsyncWiFiManagerParameter::init(const char *id, const char *placeholder, const char *defaultValue, int length, const char *custom) {
  _id = id;
  _placeholder = placeholder;
  _length = length;
  _value = new char[length + 1];
  for (int i = 0; i < length; i++) {
    _value[i] = 0;
  }
  if (defaultValue != NULL) {
    strncpy(_value, defaultValue, length);
  }

  _customHTML = custom;
}

const char* AsyncWiFiManagerParameter::getValue() {
  return _value;
}
const char* AsyncWiFiManagerParameter::getID() {
  return _id;
}
const char* AsyncWiFiManagerParameter::getPlaceholder() {
  return _placeholder;
}
int AsyncWiFiManagerParameter::getValueLength() {
  return _length;
}
const char* AsyncWiFiManagerParameter::getCustomHTML() {
  return _customHTML;
}
//static ESP32WiFiManager* self = NULL; //TO DO
ESP32WiFiManager::ESP32WiFiManager() {

  wifiSSIDs = NULL;
  wifiSSIDscan=true;
  _modeless=false;
  shouldscan=true;
  //self = this;
  autoconnect_httpd = NULL;
}
ESP32WiFiManager::~ESP32WiFiManager() {
	//self = NULL;
}
void ESP32WiFiManager::addParameter(AsyncWiFiManagerParameter *p) {
  _params[_paramsCount] = p;
  _paramsCount++;
  DEBUG_WM("Adding parameter");
  DEBUG_WM(p->getID());
}
void     ESP32WiFiManager::cleanParameters() {
	_paramsCount = 0;
}


void ESP32WiFiManager::setupConfigPortal() {
  // dnsServer.reset(new DNSServer());
  // server.reset(new ESP8266WebServer(80));
 // server->reset();

  DEBUG_WM(F(""));
  _configPortalStart = millis();

  DEBUG_WM(F("Configuring access point... "));
  DEBUG_WM(_apName);
  if (_apPassword != NULL) {
    if (strlen(_apPassword) < 8 || strlen(_apPassword) > 63) {
      // fail passphrase to short or long!
      DEBUG_WM(F("Invalid AccessPoint password. Ignoring"));
      _apPassword = NULL;
    }
    DEBUG_WM(_apPassword);
  }

  //optional soft ip config
  if (_ap_static_ip) {
    DEBUG_WM(F("Custom AP IP/GW/Subnet"));
    WiFi.softAPConfig(_ap_static_ip, _ap_static_gw, _ap_static_sn);
  }

  if (_apPassword != NULL) {
    WiFi.softAP(_apName, _apPassword);//password option
  } else {
    WiFi.softAP(_apName);
  }

  delay(500); // Without delay I've seen the IP address blank
  DEBUG_WM(F("AP IP address: "));
  DEBUG_WM(WiFi.softAPIP());

  /* Setup the DNS server redirecting all the domains to the apIP */
  #ifdef USE_EADNS
  dnsServer->setErrorReplyCode(AsyncDNSReplyCode::NoError);
  #else
  //dnsServer->setErrorReplyCode(DNSReplyCode::NoError);
  #endif
 // dnsServer->start(DNS_PORT, "*", WiFi.softAPIP());

  setInfo();
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();



  /*
  httpd_uri_t root_uri = {
		.uri = "/",
		.method = HTTP_GET,
		.handler = HANDLER_FN(Root) ,
		.user_ctx = this
  };
  */
  httpd_uri_t root_uri=URI_INIT("/", Root);
  httpd_uri_t wifiuri = URI_INIT_1("/wifi", Wifi, true);
  httpd_uri_t wifi0uri = URI_INIT_1("/0wifi", Wifi, false);
  httpd_uri_t wifisave = URI_INIT("/wifisave", WifiSave);
  httpd_uri_t _i = URI_INIT("/i", Info);
  httpd_uri_t _r = URI_INIT("/r", Reset);
 // httpd_uri_t h_204 = URI_INIT("/generate_204", 204);
  httpd_uri_t fw_link = URI_INIT("/fwlink", Root);
  if (httpd_start(&autoconnect_httpd, &config) == ESP_OK) {

	  DEBUG_WM("register httpd");
	  httpd_register_uri_handler(autoconnect_httpd, &root_uri);
	  httpd_register_uri_handler(autoconnect_httpd, &wifiuri);
	  httpd_register_uri_handler(autoconnect_httpd, &wifi0uri);
	  httpd_register_uri_handler(autoconnect_httpd, &wifisave);
	  httpd_register_uri_handler(autoconnect_httpd, &_i);
	  httpd_register_uri_handler(autoconnect_httpd, &_r);
	 // httpd_register_uri_handler(autoconnect_httpd, &h_204);
	  httpd_register_uri_handler(autoconnect_httpd, &fw_link);


  }
  /* Setup web pages: root, wifi config pages, SO captive portal detectors and not found. */
  /*
  server->on("/", std::bind(&AsyncWiFiManager::handleRoot, this,std::placeholders::_1)).setFilter(ON_AP_FILTER);
  server->on("/wifi", std::bind(&AsyncWiFiManager::handleWifi, this, std::placeholders::_1,true)).setFilter(ON_AP_FILTER);
  server->on("/0wifi", std::bind(&AsyncWiFiManager::handleWifi, this,std::placeholders::_1, false)).setFilter(ON_AP_FILTER);
  server->on("/wifisave", std::bind(&AsyncWiFiManager::handleWifiSave,this,std::placeholders::_1)).setFilter(ON_AP_FILTER);
  server->on("/i", std::bind(&AsyncWiFiManager::handleInfo,this, std::placeholders::_1)).setFilter(ON_AP_FILTER);
  server->on("/r", std::bind(&AsyncWiFiManager::handleReset, this,std::placeholders::_1)).setFilter(ON_AP_FILTER);
  //server->on("/generate_204", std::bind(&AsyncWiFiManager::handle204, this));  //Android/Chrome OS captive portal check.
  server->on("/fwlink", std::bind(&AsyncWiFiManager::handleRoot, this,std::placeholders::_1)).setFilter(ON_AP_FILTER);  //Microsoft captive portal. Maybe not needed. Might be handled by notFound handler.
  server->onNotFound (std::bind(&AsyncWiFiManager::handleNotFound,this,std::placeholders::_1));
  server->begin(); // Web server start
  */
  DEBUG_WM(F("HTTP server started"));

}

static const char HEX_CHAR_ARRAY[17] = "0123456789ABCDEF";
/**
* convert char array (hex values) to readable string by seperator
* buf:           buffer to convert
* length:        data length
* strSeperator   seperator between each hex value
* return:        formated value as String
*/
static String byteToHexString(uint8_t* buf, uint8_t length, String strSeperator="-") {
  String dataString = "";
  for (uint8_t i = 0; i < length; i++) {
    byte v = buf[i] / 16;
    byte w = buf[i] % 16;
    if (i>0) {
      dataString += strSeperator;
    }
    dataString += String(HEX_CHAR_ARRAY[v]);
    dataString += String(HEX_CHAR_ARRAY[w]);
  }
  dataString.toUpperCase();
  return dataString;
} // byteToHexString

#if !defined(ESP8266)
String getESP32ChipID() {
  uint64_t chipid;
  chipid=ESP.getEfuseMac();//The chip ID is essentially its MAC address(length: 6 bytes).
  int chipid_size = 6;
  uint8_t chipid_arr[chipid_size];
  for (uint8_t i=0; i < chipid_size; i++) {
    chipid_arr[i] = (chipid >> (8 * i)) & 0xff;
  }
  return byteToHexString(chipid_arr, chipid_size, "");
}
#endif

boolean ESP32WiFiManager::autoConnect(bool bstartConfig) {
  String ssid = "ESP";

  ssid += getESP32ChipID();

