Yurik72/ESPHap/examples/ESPHAPCamera/ESP32WiFiManager.cpp
  return autoConnect(ssid.c_str(), NULL, bstartConfig);
}
void    ESP32WiFiManager::startOfflineApp(char const *apName, char const *apPassword ){
	DEBUG_WM(F("startOfflineApp"));
	Serial.println((long)this);
	DEBUG_WM(apName);
	_apName = apName;
	_apPassword = apPassword;
	WiFi.mode(WIFI_AP);
	setupConfigPortal();
	scan();
}
boolean ESP32WiFiManager::autoConnect(char const *apName, char const *apPassword, bool bstartConfig) {
  DEBUG_WM(F(""));
  DEBUG_WM(F("AutoConnect"));

  // read eeprom for ssid and pass
  //String ssid = getSSID();
  //String pass = getPassword();

  // attempt to connect; should it fail, fall back to AP
  WiFi.mode(WIFI_STA);

  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE);
  if (!WiFi.setHostname(apName)) {
	  DEBUG_WM("Host name is not set");
  }


  if (connectWifi("", "", apName) == WL_CONNECTED)   {
    DEBUG_WM(F("IP Address:"));
    DEBUG_WM(WiFi.localIP());
    //connected
    return true;
  }
  if (!bstartConfig)
	  return false;
  return startConfigPortal(apName, apPassword);
}


String ESP32WiFiManager::networkListAsString()
{
  String pager ;
  DEBUG_WM("networkListAsString");
  if(wifiSSIDs==NULL){
	  DEBUG_WM("internal problem with network list");
	  return pager;
  }
  //display networks in page
  for (int i = 0; i < wifiSSIDCount; i++) {

	  DEBUG_WM(i);
    if (wifiSSIDs[i].duplicate == true) continue; // skip dups
    int quality = getRSSIasQuality(wifiSSIDs[i].RSSI);

    if (_minimumQuality == -1 || _minimumQuality < quality) {
      String item = FPSTR(HTTP_ITEM);
      String rssiQ;
      rssiQ += quality;
      item.replace("{v}", wifiSSIDs[i].SSID);
      item.replace("{r}", rssiQ);
#if defined(ESP8266)
      if (wifiSSIDs[i].encryptionType != ENC_TYPE_NONE) {
#else
      if (wifiSSIDs[i].encryptionType != WIFI_AUTH_OPEN) {
#endif
        item.replace("{i}", "l");
      } else {
        item.replace("{i}", "");
      }
      pager += item;

    } else {
      DEBUG_WM(F("Skipping due to quality"));
    }

  }
  return pager;
}

String ESP32WiFiManager::scanModal()
{
  shouldscan=true;
  scan();
  String pager=networkListAsString();
  return pager;
}

void ESP32WiFiManager::scan()
{
  if (!shouldscan) return;

  DEBUG_WM(F("About to scan()"));
  DEBUG_WM(wifiSSIDscan);
  delay(100);
 // if (wifiSSIDscan)
 // {
 //   delay(100);
//  }

  if (wifiSSIDscan)
  {
    int n = WiFi.scanNetworks();
    if(n==WIFI_SCAN_RUNNING){
    	delay(1000);
    	n = WiFi.scanNetworks();
    }
    if(n==WIFI_SCAN_FAILED){
    	WiFi.mode(WIFI_AP);
    	delay(1000);
    	n = WiFi.scanNetworks();
    	delay(1000);
    	WiFi.mode(WIFI_AP_STA);
    }
    DEBUG_WM(F("Scan done"));
    if (n == 0) {
      DEBUG_WM(F("No networks found"));
      // page += F("No networks found. Refresh to scan again.");
      wifiSSIDCount = 0;
    }
    else if (n < 0) {
      DEBUG_WM(F("Scan network return negative value"));
      n = 0;
      wifiSSIDCount = 0;
    } else {


      if (wifiSSIDscan)
      {
        /* WE SHOULD MOVE THIS IN PLACE ATOMICALLY */
        if (wifiSSIDs) delete [] wifiSSIDs;
        wifiSSIDs = new WiFiResult[n];
        wifiSSIDCount = n;

        if (n>0)
        shouldscan=false;

        for (int i=0;i<n;i++)
        {
          wifiSSIDs[i].duplicate=false;

#if defined(ESP8266)
          bool res=WiFi.getNetworkInfo(i, wifiSSIDs[i].SSID, wifiSSIDs[i].encryptionType, wifiSSIDs[i].RSSI, wifiSSIDs[i].BSSID, wifiSSIDs[i].channel, wifiSSIDs[i].isHidden);
#else
          bool res=WiFi.getNetworkInfo(i, wifiSSIDs[i].SSID, wifiSSIDs[i].encryptionType, wifiSSIDs[i].RSSI, wifiSSIDs[i].BSSID, wifiSSIDs[i].channel);
#endif
        }


        // RSSI SORT

        // old sort
        for (int i = 0; i < n; i++) {
          for (int j = i + 1; j < n; j++) {
            if (wifiSSIDs[j].RSSI > wifiSSIDs[i].RSSI) {
              std::swap(wifiSSIDs[i], wifiSSIDs[j]);
            }
          }
        }


        // remove duplicates ( must be RSSI sorted )
        if (_removeDuplicateAPs) {
          String cssid;
          for (int i = 0; i < n; i++) {
            if (wifiSSIDs[i].duplicate == true) continue;
            cssid = wifiSSIDs[i].SSID;
            for (int j = i + 1; j < n; j++) {
              if (cssid == wifiSSIDs[j].SSID) {
                DEBUG_WM("DUP AP: " +wifiSSIDs[j].SSID);
                wifiSSIDs[j].duplicate=true; // set dup aps to NULL
              }
            }
          }
        }

      }
    }
  }
}


void ESP32WiFiManager::startConfigPortalModeless(char const *apName, char const *apPassword) {

  _modeless =true;
  _apName = apName;
  _apPassword = apPassword;

  /*
  AJS - do we want this?

  */

  //setup AP
  WiFi.mode(WIFI_AP_STA);
  DEBUG_WM("SET AP STA");

  // try to connect
  if (connectWifi("", "", apName) == WL_CONNECTED)   {
    DEBUG_WM(F("IP Address:"));
    DEBUG_WM(WiFi.localIP());
    //connected
    // call the callback!
  //  if ( _savecallback != NULL) {
    		  //todo: check if any custom parameters actually exist, and check if they really changed maybe
  //  		  _savecallback();
  //  }

  }



  //notify we entered AP mode
  if ( _apcallback != NULL) {
    _apcallback(this);
  }

  connect = false;
  setupConfigPortal();
  scannow= -1 ;

}

void ESP32WiFiManager::loop(){
	safeLoop();
	criticalLoop();
	vTaskDelay(50);
}

void ESP32WiFiManager::setInfo() {
	DEBUG_WM(F("setInfo"));
	if (needInfo) {
		pager = infoAsString();
		//DEBUG_WM(pager);
	    wifiStatus = WiFi.status();
	    needInfo = false;
	}
}

/**
 * Anything that accesses WiFi, ESP or EEPROM goes here
 */
void ESP32WiFiManager::criticalLoop(){
  if (_modeless)
  {
	  vTaskDelay(50);
	if ( scannow==-1 || millis() > scannow + 60000)
	{

	  scan();
	  scannow= millis() ;
	}
	if (connect) {
		connect = false;
	  //delay(2000);
	  DEBUG_WM(F("Connecting to new AP"));

	  // using user-provided  _ssid, _pass in place of system-stored ssid and pass
	  if (connectWifi(_ssid, _pass, _apName) != WL_CONNECTED) {
		DEBUG_WM(F("Failed to connect."));
	  } else {
		//connected
		// alanswx - should we have a config to decide if we should shut down AP?
		// WiFi.mode(WIFI_STA);
		//notify that configuration has changed and any optional parameters should be saved
		if ( _savecallback != NULL) {
		  //todo: check if any custom parameters actually exist, and check if they really changed maybe
		  _savecallback();
		}

		return;
	  }

	  if (_shouldBreakAfterConfig) {
		//flag set to exit after config after trying to connect
		//notify that configuration has changed and any optional parameters should be saved
		if ( _savecallback != NULL) {
		  //todo: check if any custom parameters actually exist, and check if they really changed maybe
		  _savecallback();
		}
	  }
	}
  }
}

