Yurik72/ESPHap/examples/ESPHAPCamera/ESP32WiFiManager.cpp
/*
 * Anything that doesn't access WiFi, ESP or EEPROM can go here
 */
void ESP32WiFiManager::safeLoop(){
  #ifndef USE_EADNS	
  //dnsServer->processNextRequest();
  #endif
}

boolean  ESP32WiFiManager::startConfigPortal(char const *apName, char const *apPassword) {
  //setup AP
  WiFi.mode(WIFI_AP_STA);
  DEBUG_WM("SET AP STA");

  _apName = apName;
  _apPassword = apPassword;

  //notify we entered AP mode
  if ( _apcallback != NULL) {
    _apcallback(this);
  }

  connect = false;
  setupConfigPortal();
  scannow= -1 ;
  while (_configPortalTimeout == 0 || millis() < _configPortalStart + _configPortalTimeout) {
    //DNS
    #ifndef USE_EADNS	
    //dnsServer->processNextRequest();
    #endif
	
    //
    //  we should do a scan every so often here
    //
    if ( millis() > scannow + 10000)
    {
      DEBUG_WM(F("About to scan()"));
      DEBUG_WM(wifiSSIDscan);
      shouldscan=true;  // since we are modal, we can scan every time
      scan();
      scannow= millis() ;
    }


    if (connect) {
      connect = false;
      delay(2000);
      DEBUG_WM(F("Connecting to new AP"));

      // using user-provided  _ssid, _pass in place of system-stored ssid and pass
      if (connectWifi(_ssid, _pass, apName) != WL_CONNECTED) {
        DEBUG_WM(F("Failed to connect."));
      } else {
        //connected
        WiFi.mode(WIFI_STA);
        //notify that configuration has changed and any optional parameters should be saved
        if ( _savecallback != NULL) {
          //todo: check if any custom parameters actually exist, and check if they really changed maybe
          _savecallback();
        }
        break;
      }

      if (_shouldBreakAfterConfig) {
        //flag set to exit after config after trying to connect
        //notify that configuration has changed and any optional parameters should be saved
        if ( _savecallback != NULL) {
          //todo: check if any custom parameters actually exist, and check if they really changed maybe
          _savecallback();
        }
        break;
      }
    }
    yield();
  }

 // server->reset();
  #ifdef USE_EADNS
  *dnsServer=AsyncDNSServer();
  #else
 // *dnsServer=DNSServer();
  #endif

  return  WiFi.status() == WL_CONNECTED;
}


int ESP32WiFiManager::connectWifi(String ssid, String pass, String hostName) {
  DEBUG_WM(F("Connecting as wifi client..."));
  hostName.toLowerCase();
  // check if we've got static_ip settings, if we do, use those.
  if (_sta_static_ip) {
    DEBUG_WM(F("Custom STA IP/GW/Subnet/DNS"));
    WiFi.config(_sta_static_ip, _sta_static_gw, _sta_static_sn, _sta_static_dns1, _sta_static_dns2);
    DEBUG_WM(WiFi.localIP());
  }
  //fix for auto connect racing issue
  //  if (WiFi.status() == WL_CONNECTED) {
  //    DEBUG_WM("Already connected. Bailing out.");
  //    return WL_CONNECTED;
  //  }
  //check if we have ssid and pass and force those, if not, try with last saved values
  DEBUG_WM(ssid);
  DEBUG_WM(pass);

  if (ssid != "") {

    WiFi.disconnect(false);

	//https://github.com/espressif/arduino-esp32/issues/2537

	WiFi.setHostname(hostName.c_str());


    WiFi.begin(ssid.c_str(), pass.c_str());
  } else {
    if (WiFi.SSID().length() > 0) {
      DEBUG_WM("Using last saved values, should be faster");

      WiFi.disconnect(false);


	  WiFi.setHostname(hostName.c_str());

      WiFi.begin();
    } else {

		WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE);
		if (!WiFi.setHostname(hostName.c_str())) {
			DEBUG_WM("Host name is not set");
		}


	  //DEBUG_WM(hostName);
      DEBUG_WM("Try to connect with saved credentials");
      WiFi.begin();
	  
    }
  }

  int connRes = waitForConnectResult();
  DEBUG_WM ("Connection result: ");
  DEBUG_WM ( connRes );
  //not connected, WPS enabled, no pass - first attempt
#ifdef NO_EXTRA_4K_HEAP	
  if (_tryWPS && connRes != WL_CONNECTED && pass == "") {
    startWPS();
    //should be connected at the end of WPS
    connRes = waitForConnectResult();
  }
#endif
  needInfo = true;
  setInfo();
  return connRes;
}

uint8_t ESP32WiFiManager::waitForConnectResult() {
  if (_connectTimeout == 0) {
    return WiFi.waitForConnectResult();
  } else {
    DEBUG_WM (F("Waiting for connection result with time out"));
    unsigned long start = millis();
    boolean keepConnecting = true;
    uint8_t status;
    while (keepConnecting) {
      status = WiFi.status();
      if (millis() > start + _connectTimeout) {
        keepConnecting = false;
        DEBUG_WM (F("Connection timed out"));
      }
      if (status == WL_CONNECTED || status == WL_CONNECT_FAILED) {
        keepConnecting = false;
      }
      delay(100);
    }
    return status;
  }
}


String ESP32WiFiManager::getConfigPortalSSID() {
  return _apName;
}

void ESP32WiFiManager::resetSettings() {
  DEBUG_WM(F("settings invalidated"));
  DEBUG_WM(F("THIS MAY CAUSE AP NOT TO START UP PROPERLY. YOU NEED TO COMMENT IT OUT AFTER ERASING THE DATA."));
  WiFi.disconnect(true);
  //delay(200);
}
void ESP32WiFiManager::setTimeout(unsigned long seconds) {
  setConfigPortalTimeout(seconds);
}

void ESP32WiFiManager::setConfigPortalTimeout(unsigned long seconds) {
  _configPortalTimeout = seconds * 1000;
}

void ESP32WiFiManager::setConnectTimeout(unsigned long seconds) {
  _connectTimeout = seconds * 1000;
}

void ESP32WiFiManager::setDebugOutput(boolean debug) {
  _debug = debug;
}

void ESP32WiFiManager::setAPStaticIPConfig(IPAddress ip, IPAddress gw, IPAddress sn) {
  _ap_static_ip = ip;
  _ap_static_gw = gw;
  _ap_static_sn = sn;
}

void ESP32WiFiManager::setSTAStaticIPConfig(IPAddress ip, IPAddress gw, IPAddress sn, IPAddress dns1, IPAddress dns2) {
  _sta_static_ip = ip;
  _sta_static_gw = gw;
  _sta_static_sn = sn;
  _sta_static_dns1 = dns1;
  _sta_static_dns2 = dns2;
}

void ESP32WiFiManager::setMinimumSignalQuality(int quality) {
  _minimumQuality = quality;
}

void ESP32WiFiManager::setBreakAfterConfig(boolean shouldBreak) {
  _shouldBreakAfterConfig = shouldBreak;
}

/** Handle root or redirect to captive portal */
esp_err_t ESP32WiFiManager::handleRoot(httpd_req_t *req) {

  // AJS - maybe we should set a scan when we get to the root???
  // and only scan on demand? timer + on demand? plus a link to make it happen?
  shouldscan=true;
  scannow= -1 ;
  DEBUG_WM(F("Handle root"));

  //if (captivePortal(request)) { // If captive portal redirect instead of displaying the page.
 //   return;
 // }

