Yurik72/ESPHap/examples/ESPHAPCamera/ESP32WiFiManager.cpp
  String page = FPSTR(WFM_HTTP_HEAD);
  page.replace("{v}", "Options");
  page += FPSTR(HTTP_SCRIPT);
  page += FPSTR(HTTP_STYLE);
  page += _customHeadElement;
  page += FPSTR(HTTP_HEAD_END);
  page += "<h1>";
  page += _apName;
  page += "</h1>";
  page += F("<h3>WiFiManager</h3>");
  page += FPSTR(HTTP_PORTAL_OPTIONS);
  page += FPSTR(HTTP_END);
  DEBUG_WM(page);
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, page.c_str(), page.length());
 // req->send(200, "text/html", page);

//	return ESP_FAIL;
}

/** Wifi config page handler */
esp_err_t ESP32WiFiManager::handleWifi(httpd_req_t *req,boolean scan) {

  shouldscan=true;
  scannow= -1 ;
  DEBUG_WM(F("handleWifi"));
  String page = FPSTR(WFM_HTTP_HEAD);
  page.replace("{v}", "Config ESP");
  page += FPSTR(HTTP_SCRIPT);
  page += FPSTR(HTTP_STYLE);
  page += _customHeadElement;
  page += FPSTR(HTTP_HEAD_END);
  //DEBUG_WM(page);
  if (scan) {
    wifiSSIDscan=false;



    DEBUG_WM(F("Scan done"));
    if (wifiSSIDCount==0) {
      DEBUG_WM(F("No networks found"));
      page += F("No networks found. Refresh to scan again.");
    } else {

		DEBUG_WM(F("Getting network list"));
		DEBUG_WM(wifiSSIDCount);
      //display networks in page
      String pager = networkListAsString();

      page += pager;
      page += "<br/>";
    }
	DEBUG_WM(page);
  }
  wifiSSIDscan=true;

  page += FPSTR(HTTP_FORM_START);
  char parLength[2];
  // add the extra parameters to the form
  for (int i = 0; i < _paramsCount; i++) {
    if (_params[i] == NULL) {
      break;
    }

    String pitem = FPSTR(HTTP_FORM_PARAM);
    if (_params[i]->getID() != NULL) {
      pitem.replace("{i}", _params[i]->getID());
      pitem.replace("{n}", _params[i]->getID());
      pitem.replace("{p}", _params[i]->getPlaceholder());
      snprintf(parLength, 2, "%d", _params[i]->getValueLength());
      pitem.replace("{l}", parLength);
      pitem.replace("{v}", _params[i]->getValue());
      pitem.replace("{c}", _params[i]->getCustomHTML());
    } else {
      pitem = _params[i]->getCustomHTML();
    }

    page += pitem;
  }
  if (_params[0] != NULL) {
    page += "<br/>";
  }

  if (_sta_static_ip) {

    String item = FPSTR(HTTP_FORM_PARAM);
    item.replace("{i}", "ip");
    item.replace("{n}", "ip");
    item.replace("{p}", "Static IP");
    item.replace("{l}", "15");
    item.replace("{v}", _sta_static_ip.toString());

    page += item;

    item = FPSTR(HTTP_FORM_PARAM);
    item.replace("{i}", "gw");
    item.replace("{n}", "gw");
    item.replace("{p}", "Static Gateway");
    item.replace("{l}", "15");
    item.replace("{v}", _sta_static_gw.toString());

    page += item;

    item = FPSTR(HTTP_FORM_PARAM);
    item.replace("{i}", "sn");
    item.replace("{n}", "sn");
    item.replace("{p}", "Subnet");
    item.replace("{l}", "15");
    item.replace("{v}", _sta_static_sn.toString());

    page += item;

    item = FPSTR(HTTP_FORM_PARAM);
    item.replace("{i}", "dns1");
    item.replace("{n}", "dns1");
    item.replace("{p}", "DNS1");
    item.replace("{l}", "15");
    item.replace("{v}", _sta_static_dns1.toString());

    page += item;

    item = FPSTR(HTTP_FORM_PARAM);
    item.replace("{i}", "dns2");
    item.replace("{n}", "dns2");
    item.replace("{p}", "DNS2");
    item.replace("{l}", "15");
    item.replace("{v}", _sta_static_dns2.toString());

    page += item;

    page += "<br/>";
  }

  page += FPSTR(HTTP_FORM_END);
  page += FPSTR(HTTP_SCAN_LINK);

  page += FPSTR(HTTP_END);
  DEBUG_WM(F("Sending wifi config page"));
 // request->send(200, "text/html", page);

  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, page.c_str(), page.length());
  DEBUG_WM(F("Sent config page"));

}

/** Handle the WLAN save form and redirect to WLAN config page again */
esp_err_t ESP32WiFiManager::handleWifiSave(httpd_req_t *req) {

  DEBUG_WM(F("WiFi save"));

  //SAVE/connect here
  needInfo = true;
  size_t buf_len = httpd_req_get_url_query_len(req) + 1;

  char value[32] = { 0, };
  char*  buf=NULL;
  if (buf_len > 1) {
	  buf = (char*)malloc(buf_len);
	  if (!buf) {
		  httpd_resp_send_500(req);
		  return ESP_FAIL;
	  }
	  if (httpd_req_get_url_query_str(req, buf, buf_len) != ESP_OK) {
		  free(buf);
		  httpd_resp_send_404(req);
		  return ESP_FAIL;
	  }
  }
  if (httpd_query_key_value(buf, "s", value, sizeof(value)) == ESP_OK)
	  _ssid = local_urldecode(value);
  if (httpd_query_key_value(buf, "p", value, sizeof(value)) == ESP_OK)
	  _pass = local_urldecode(value);
  //_ssid = request->arg("s").c_str();
 // _pass = request->arg("p").c_str();

  //parameters
  for (int i = 0; i < _paramsCount; i++) {
    if (_params[i] == NULL) {
      break;
    }
    //read parameter
	String svalue;
	if (httpd_query_key_value(buf, _params[i]->getID(), value, sizeof(value)) == ESP_OK)
		svalue = value;
    //String value = request->arg(_params[i]->getID()).c_str();
    //store it in array
    svalue.toCharArray(_params[i]->_value, _params[i]->_length);
    DEBUG_WM(F("Parameter"));
    DEBUG_WM(_params[i]->getID());
    DEBUG_WM(svalue);
  }

 // if (request->hasArg("ip")) {
  if (httpd_query_key_value(buf, "ip", value, sizeof(value)) == ESP_OK){
    DEBUG_WM(F("static ip"));
    DEBUG_WM(value);
    //_sta_static_ip.fromString(request->arg("ip"));
    String ip = local_urldecode(value);
    optionalIPFromString(&_sta_static_ip, ip.c_str());
  }
 // if (request->hasArg("gw")) {
if (httpd_query_key_value(buf, "gw", value, sizeof(value)) == ESP_OK){
    DEBUG_WM(F("static gateway"));
    DEBUG_WM(value);
    String gw = local_urldecode(value);
    optionalIPFromString(&_sta_static_gw, gw.c_str());
  }
  //if (request->hasArg("sn")) {
if (httpd_query_key_value(buf, "sn", value, sizeof(value)) == ESP_OK) {
    DEBUG_WM(F("static netmask"));
    DEBUG_WM(value);
    String sn = local_urldecode(value);
    optionalIPFromString(&_sta_static_sn, sn.c_str());
  }

 // if (request->hasArg("dns1")) {
if (httpd_query_key_value(buf, "dns1", value, sizeof(value)) == ESP_OK) {
    DEBUG_WM(F("static DNS 1"));
    DEBUG_WM(value);
    String dns1 = local_urldecode(value);
    optionalIPFromString(&_sta_static_dns1, dns1.c_str());
  }
 // if (request->hasArg("dns2")) {
if (httpd_query_key_value(buf, "dns2", value, sizeof(value)) == ESP_OK) {
    DEBUG_WM(F("static DNS 2"));
    DEBUG_WM(value);
    String dns2 = local_urldecode(value);
    optionalIPFromString(&_sta_static_dns2, dns2.c_str());
  }

